docs/test_1500rps.txt

Summary:
  Total:	30.0004 secs
  Slowest:	1.1119 secs
  Fastest:	0.0401 secs
  Average:	0.1240 secs
  Requests/sec:	13328.9440
  
  Total data:	309632 bytes
  Size/request:	164 bytes

Response time histogram:
  0.040 [1]	|
  0.147 [1337]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.254 [443]	|■■■■■■■■■■■■■
  0.362 [70]	|■■
  0.469 [27]	|■
  0.576 [7]	|
  0.683 [2]	|
  0.790 [0]	|
  0.898 [0]	|
  1.005 [0]	|
  1.112 [1]	|


Latency distribution:
  10% in 0.0515 secs
  25% in 0.0669 secs
  50% in 0.1018 secs
  75% in 0.1573 secs
  90% in 0.2049 secs
  95% in 0.2699 secs
  99% in 0.4228 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0026 secs, 0.0401 secs, 1.1119 secs
  DNS-lookup:	0.0010 secs, 0.0000 secs, 0.0378 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0006 secs
  resp wait:	0.1210 secs, 0.0400 secs, 1.1118 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0700 secs

Status code distribution:
  [200]	1888 responses

Error distribution:
  [47]	Post "http://afedf71dc85bc4d4eb9c9421604ace56-891404600.us-east-1.elb.amazonaws.com/api/car-analysis": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
  [397936]	Post "http://afedf71dc85bc4d4eb9c9421604ace56-891404600.us-east-1.elb.amazonaws.com/api/car-analysis": dial tcp: lookup afedf71dc85bc4d4eb9c9421604ace56-891404600.us-east-1.elb.amazonaws.com: no such host
  [1]	Post "http://afedf71dc85bc4d4eb9c9421604ace56-891404600.us-east-1.elb.amazonaws.com/api/car-analysis": read tcp 192.168.1.175:49349->3.225.86.39:80: read: can't assign requested address
  [1]	Post "http://afedf71dc85bc4d4eb9c9421604ace56-891404600.us-east-1.elb.amazonaws.com/api/car-analysis": read tcp 192.168.1.175:49350->3.225.86.39:80: read: can't assign requested address
  [1]	Post "http://afedf71dc85bc4d4eb9c9421604ace56-891404600.us-east-1.elb.amazonaws.com/api/car-analysis": read tcp 192.168.1.175:49362->3.225.86.39:80: read: can't assign requested address